In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({ 'letters':['A','C','C','B','C', 'A','A','A','C','C','C']})
df

   letters
0        A
1        C
2        C
3        B
4        C
5        A
6        A
7        A
8        C
9        C
10       C

In [3]:
df['subgroup'] = (df['letters'] != df['letters'].shift(1)).cumsum()
df_grouped = pd.DataFrame(df.groupby('subgroup').apply(lambda x: (x['letters'].head(1).values[0], 
                                                                  x.shape[0])), columns = ['text']).reset_index()

In [4]:
df_grouped[['text', 'text_count']] = (df_grouped['text'].apply(pd.Series))

In [5]:
df_grouped.drop('subgroup', axis=1, inplace=True)

In [6]:
df_grouped

  text  text_count
0    A           1
1    C           2
2    B           1
3    C           1
4    A           3
5    C           3